import string

# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
#Фразы отделяются друг от друга пробелами.

#В ответе напишите Парам пам-пам, если с ритмом все в порядке и 
# Пам парам, если с ритмом все не в порядке.
# Если фраза только одна, необходимо вывести: 
# Количество фраз должно быть больше одной!.

stroka = 'пара-ра-рам рам-пам-папам па-ра-па-дам'

wovels = ('А','О','У','Ы','Э','Е','Ё','И','Ю','Я')


print(type(wovels))
print(stroka.upper())

